#define _CRT_SECURE_NO_WARNINGS
#define _USE_MINGW_ANSI_STDIO 1
#include <cmath>		// pow, sqrt, etc
#include <cstdio>		// printf, scanf, getchar, etc
#include <conio.h>		// getche
#include <climits>		// xxx_MAX,xxx_MIN
#include <cstdlib>		// maybe need...
#include <iostream>
#include <algorithm>	// everything is in here
#include <Windows.h>	// maybe need...
#include <complex>
#include <vector>

#include "FFT.h"
#include "expre.h"
#include "power.h"
#include "lglrcz.h"
#include "bigint.h"
#include "triangle.h" //sine, cosine, a2r
#include "fraction.h"
#include "calculate.h"
#include "polynomial.h"
#include "huffmancode.h"

using namespace std;

int main()
{
	vector<int> a;
	a < vector<int>();
	cout << lglrcz({{ 0, 0 }, { 1, 0 }, { 2, 0 }, { 3, 0 }, { 4, 0 }, { 5, 0 }, { 6, 0 }, { 7, 0 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 0 }, { 2, 0 }, { 3, 0 }, { 4, 0 }, { 5, 0 }, { 6, 0 }, { 7, 0 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 0 }, { 2, 1 }, { 3, 0 }, { 4, 0 }, { 5, 0 }, { 6, 1 }, { 7, 1 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 0 }, { 2, 0 }, { 3, 2 }, { 4, 2 }, { 5, 0 }, { 6, 2 }, { 7, 0 }, { 8, 0 }, { 9, 1 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 0 }, { 2, 0 }, { 3, 1 }, { 4, 0 }, { 5, 1 }, { 6, 0 }, { 7, 1 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 2 }, { 1, 2 }, { 2, 0 }, { 3, 2 }, { 4, 1 }, { 5, 0 }, { 6, 2 }, { 7, 2 }, { 8, 2 }, { 9, 2 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 0 }, { 2, 0 }, { 3, 1 }, { 4, 0 }, { 5, 1 }, { 6, 0 }, { 7, 1 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 2 }, { 2, 0 }, { 3, 2 }, { 4, 1 }, { 5, 0 }, { 6, 2 }, { 7, 2 }, { 8, 2 }, { 9, 2 }}) << endl;
	cout << lglrcz({{ 0, 1 }, { 1, 0 }, { 2, 0 }, { 3, 1 }, { 4, 1 }, { 5, 1 }, { 6, 0 }, { 7, 0 }, { 8, 1 }, { 9, 1 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 2 }, { 2, 1 }, { 3, 0 }, { 4, 1 }, { 5, 1 }, { 6, 0 }, { 7, 2 }, { 8, 2 }, { 9, 2 }}) << endl;
	cout << lglrcz({{ 0, 1 }, { 1, 0 }, { 2, 0 }, { 3, 0 }, { 4, 1 }, { 5, 1 }, { 6, 0 }, { 7, 0 }, { 8, 1 }, { 9, 1 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 2 }, { 2, 1 }, { 3, 1 }, { 4, 2 }, { 5, 1 }, { 6, 0 }, { 7, 2 }, { 8, 2 }, { 9, 2 }}) << endl;
	cout << lglrcz({{ 0, 1 }, { 1, 0 }, { 2, 1 }, { 3, 1 }, { 4, 1 }, { 5, 0 }, { 6, 1 }, { 7, 0 }, { 8, 1 }, { 9, 1 }}) << endl;
	cout << lglrcz({{ 0, 2 }, { 1, 2 }, { 2, 1 }, { 3, 1 }, { 4, 0 }, { 5, 1 }, { 6, 0 }, { 7, 2 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 0 }, { 2, 1 }, { 3, 0 }, { 4, 0 }, { 5, 0 }, { 6, 1 }, { 7, 0 }, { 8, 1 }, { 9, 1 }}) << endl;
	cout << lglrcz({{ 0, 2 }, { 1, 2 }, { 2, 1 }, { 3, 0 }, { 4, 2 }, { 5, 1 }, { 6, 0 }, { 7, 2 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 1 }, { 1, 0 }, { 2, 1 }, { 3, 1 }, { 4, 0 }, { 5, 0 }, { 6, 1 }, { 7, 0 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 2 }, { 1, 2 }, { 2, 2 }, { 3, 0 }, { 4, 2 }, { 5, 2 }, { 6, 1 }, { 7, 2 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 0 }, { 2, 1 }, { 3, 0 }, { 4, 0 }, { 5, 0 }, { 6, 1 }, { 7, 0 }, { 8, 0 }, { 9, 0 }}) << endl;
	cout << lglrcz({{ 0, 2 }, { 1, 2 }, { 2, 2 }, { 3, 2 }, { 4, 2 }, { 5, 2 }, { 6, 1 }, { 7, 2 }, { 8, 1 }, { 9, 1 }}) << endl;
	cout << lglrcz({{ 0, 0 }, { 1, 0 }, { 2, 0 }, { 3, 0 }, { 4, 0 }, { 5, 1 }, { 6, 0 }, { 7, 0 }, { 8, 1 }, { 9, 1 }}) << endl;
	cout << lglrcz({{ 0, 2 }, { 1, 2 }, { 2, 2 }, { 3, 2 }, { 4, 2 }, { 5, 2 }, { 6, 1 }, { 7, 2 }, { 8, 1 }, { 9, 1 }}) << endl;
	return 0;
}

/*
k_{g1} = [0, 0, 1, 0, 0, 0, 1, 1, 0, 0]
k_{g2} = [0, 0, 0, 2, 2, 0, 2, 0, 0, 1]
k_{g3} = [0, 0, 0, 1, 0, 1, 0, 1, 0, 0]
k_{g4} = [2, 2, 0, 2, 1, 0, 2, 2, 2, 2]
k_{g5} = [0, 0, 0, 1, 0, 1, 0, 1, 0, 0]
k_{g6} = [0, 2, 0, 2, 1, 0, 2, 2, 2, 2]
k_{g7} = [1, 0, 0, 1, 1, 1, 0, 0, 1, 1]
k_{g8} = [0, 2, 1, 0, 1, 1, 0, 2, 2, 2]
k_{g9} = [1, 0, 0, 0, 1, 1, 0, 0, 1, 1]
k_{g10} = [0, 2, 1, 1, 2, 1, 0, 2, 2, 2]
k_{g11} = [1, 0, 1, 1, 1, 0, 1, 0, 1, 1]
k_{g12} = [2, 2, 1, 1, 0, 1, 0, 2, 0, 0]
k_{g13} = [0, 0, 1, 0, 0, 0, 1, 0, 1, 1]
k_{g14} = [2, 2, 1, 0, 2, 1, 0, 2, 0, 0]
k_{g15} = [1, 0, 1, 1, 0, 0, 1, 0, 0, 0]
k_{g16} = [2, 2, 2, 0, 2, 2, 1, 2, 0, 0]
k_{g17} = [0, 0, 1, 0, 0, 0, 1, 0, 0, 0]
k_{g18} = [2, 2, 2, 2, 2, 2, 1, 2, 1, 1]
k_{g19} = [0, 0, 0, 0, 0, 1, 0, 0, 1, 1]
k_{g20} = [2, 2, 2, 2, 2, 2, 1, 2, 1, 1]
猫后
焰族
族长
焰星（如无人报名）
副族长
炭尾（如无人报名）
巫医
炽焰羽
武士
焰影爪（公）
火花眼（母）
长老
灰烬心
猫后
焰舞心
冰族
族长
影星（如无人报名）
副族长
泥掌（如无人报名）
巫医
寒冰羽
武士（除已知外）
冰晶眸（公）
雪舞尾（母）
长老
雪松心
猫后
冰蓝心
羽族
族长
叶星（如无人报名）
副族长
刺毛（如无人报名）
巫医
风羽心
武士（除已知外）
羽翼风（公）
羽梦痕（母）
长老
云羽心
猫后
羽灵心
金族
族长
琥珀星（如无人报名）
副族长
罂粟尾（如无人报名）
巫医
金辉羽
武士（除已知外）
金耀爪（公）
金瞳影（母）
长老
金砂心
猫后
金月心
------

*/